app/controllers/api/songs_controller.rb

    def create
        @song = Song.new(song_params)
        if @song.save!
---
INSERT INTO "songs" ("title", "description", "user_id", "genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "01 Alive (Zedd Remix)"], ["description", "EDM bro"], ["user_id", 1], ["genre", "Dance & EDM"], ["created_at", "2020-12-12 19:34:19.199884"], ["updated_at", "2020-12-12 19:34:19.199884"]]

    def update
        @song = Song.find_by(id: params[:id])

        if @song.user_id === current_user.id && @song.update(song_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "songs" SET "updated_at" = $1 WHERE "songs"."id" = $2  [["updated_at", "2020-12-14 22:04:45.968750"], ["id", 6]]

    def destroy
        @song = current_user.songs.find_by(id: params[:id])

        if @song
            @song.destroy
---
SELECT  "songs".* FROM "songs" WHERE "songs"."user_id" = $1 AND "songs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 4]]