app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "description", "password_digest", "session_token", "created_at", "updated_at", "display_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @user = User.find(params[:id])

    if (@user)
        if(@user.update(user_params))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "description" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["description", "test edit44"], ["updated_at", "2020-12-16 20:10:11.802581"], ["id", 1]]