app/views/api/users/_user.json.jbuilder

SELECT "songs"."id" FROM "songs" WHERE "songs"."user_id" = $1  [["user_id", 1]]
---
json.extract! user, :id, :username, :display_name, :description
json.trackIds user.songs.ids # trackIds: [1, 2]